<dl id="description" class="bg-white rounded-sm pt-3 pb-10 px-6" style="box-shadow: 0px 1px 5px rgba(0, 0, 0, 0.25)">
    <div class="py-6 border-b border-[#9BA2A8]">
        <dt class="text-primary font-semibold text-2xl">وصف العقار</dt>
    </div>
    <dd class="mt-8 lg:px-5 text-primary-gray text-xl/12">
        هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن
        التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم
        استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن
        استخدام "هنا يوجد محتوى نصي، هنا يوجد محتوى نصي" فتجعلها تبدو (أي الأحرف) وكأنها نص
        مقروء. العديد من برامح النشر المكتبي وبرامح تحرير صفحات الويب تستخدم لوريم إيبسوم
        بشكل إفتراضي كنموذج عن النص،
    </dd>
</dl>
