<?php

return [
    'select'    => [
        'city'  => 'اختر المدينة',
        'town'  => 'اختر المنطقة',
        'property_type' => 'اختر نوع العقار',
    ],
    'price' => [
        'min'   => 'الحد الأدنى للسعر',
        'max'   => 'الحد الأقصى للسعر',
    ],
    'filter' => 'فرز النتائج',
    'for_sale'  => 'للبيع',
    'residance' => 'سكني',
    'featured'  => 'مميز',
    'visit_all' => 'عرض الكل',
    'discover'  => [
        'by_city' => [
            'title' => 'اكتشف بالمدينة',
            'subtitle' => 'ابحث بالمدينة أو المنطقة لتجد العقار المناسب لك',
        ],
        'by_type' => [
            'title' => 'كافة أنواع العقارات',
            'subtitle' => 'متوفرة كافة أنواع العقارات التجارية والسكنية بمختلف أشكال التعاقدات',
        ],
    ],
    'be_in_touch' => 'كن على تواصل',
    'name'  => 'الاسم',
    'message'   => [
        'title' => 'عنوان الرسالة',
        'body' => 'محتوى الرسالة',
        'phone_number'  => 'رقم الهاتف',
    ],

    'contact_details' => 'بيانات التواصل',
    'welcome_message'   => 'ترحب شركة محمد الجهاني بتواصلكم وبإمكانكم التواصل عبر البيانات التالية:',
    'city_location' => 'طرابلس، ليبيا.',
    'location_details'  => 'شارع القبب السياحية بالقرب من مطعم تقسيم',
    'send'  => 'إرسال',
    'advanced_filters'  => 'بحث متقدم',
    'offers'    => [
        'sell'  => 'بيع',
        'rent' => 'إيجار',
    ],
    'furnishing'    => [
        'full'  => 'فرش كامل',
        'partial'   => 'فرش جزئي',
        'none'  => 'بدون فرش',
    ],
];
