<?php

return [
    'select'    => [
        'city'  => 'اختر المدينة',
        'town'  => 'اختر المنطقة',
        'property_type' => 'اختر نوع العقار',
    ],
    'price' => [
        'min'   => 'الحد الأدنى للسعر',
        'max'   => 'الحد الأقصى للسعر',
    ],
    'filter' => 'فرز النتائج',
    'for_sale'  => 'للبيع',
    'residance' => 'سكني',
    'featured'  => 'مميز',
    'visit_all' => 'عرض الكل',
    'discover'  => [
        'by_city' => [
            'title' => 'اكتشف بالمدينة',
            'subtitle' => 'ابحث بالمدينة أو المنطقة لتجد العقار المناسب لك'
        ],
        'by_type' => [
            'title' => 'كافة أنواع العقارات',
            'subtitle' => 'متوفرة كافة أنواع العقارات التجارية والسكنية بمختلف أشكال التعاقدات'
        ],
    ],
    'be_in_touch' => 'كن على تواصل'
];
