<?php

use function Termwind\parse;

return [
    'location'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم المنطقة بالعربي',
                'en'    =>  'اسم المنطقة بالإنجليزية',
            ],
            'parent'    => 'تابعة إلى',
            'level' => 'نوع المنطقة',
        ],
        'label' => [
            'singular' => 'منطقة',
            'plural' => 'مناطق',
        ],
    ],

    'type'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم النوع بالعربي',
                'en'    =>  'اسم النوع بالإنجليزية',
            ],
        ],
        'label' => [
            'singular' => 'نوع عقار',
            'plural' => 'أنواع العقارات',
        ],
    ],

    'category'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم التصنيف بالعربي',
                'en'    =>  'اسم التصنيف بالإنجليزية',
            ],
        ],
        'label' => [
            'singular' => 'تصنيف العقار',
            'plural' => 'تصنيفات العقارات',
        ],
    ],

    'feature'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم المرفق بالعربي',
                'en'    =>  'اسم المرفق بالإنجليزية',
            ],
            'type'  => 'نوع المرفق',
            'types' => [
                'boolean' => 'نعم / لا',
                'number'    => 'قيمة رقمية',
                'select'    => 'قائمة اختيار',
            ],
            'group' => 'مجموعة المرفق',
            'group_hint'    => 'الميزات الداخلية, الميزات الخارجية, الخدمات الأساسية...',
            'type_options'  => [
                'label' => 'الخيارات',
                'value' => [
                    'ar'    => 'اسم الخيار بالعربي',
                    'en'    => 'اسم الخيار بالإنجليزية',
                ],
            ],
        ],
        'label' => [
            'singular' => 'مرفق',
            'plural' => 'المرافق',
        ],
    ],

    'feature_group'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'الإسم بالعربي',
                'en'    =>  'الإسم بالإنجليزية',
            ],
            'sort_order'    => 'الترتيب',
        ],
        'label' => [
            'singular' => 'مجموعة مرفق',
            'plural' => 'مجموعات المرافق',
        ],
    ],

    'property'  => [
        'fields'    => [
            'title'  => [
                'ar'    =>  'العنوان بالعربي',
                'en'    =>  'العنوان بالإنجليزية',
            ],
            'brief' =>  [
                'ar'    =>  'وصف مختصر بالعربي',
                'en' => 'وصف مختصر بالإنجليزية',
            ],
            'description'   =>  [
                'ar'    => 'وصف العقار بالعربي',
                'en'    => 'وصف العقار بالإنجليزية',
            ],
            'reference' => 'رقم الإعلان الإشاري',
            'price' => 'السعر',
            'type'  => 'النوع',
            'category'  => 'التصنيف',
            'offer' => 'العرض',
            'area'  => 'المساحة',
            'floors'    => 'عدد الطوابق',
            'floored_area' => 'المسقوف',
            'rooms' => 'عدد الغرف',
            'parking_capacity' => 'سعة الجراج',
            'published_at'  => 'تاريخ نشر الإعلان',
            'delivery_date' => 'تاريخ التسليم',
            'location'  => 'العنوان',
            'map_url'   => 'العنوان على الخريطة',
            'is_fully_furnished' => 'مفروش بالكامل؟',
            'nearest_landmark' => [
                'ar'    => 'أقرب نقطة دالة بالعربي',
                'en'    => 'أقرب نقطة دالة بالإنجليزية',
            ],
        ],
        'label' => [
            'singular' => 'عقار',
            'plural' => 'العقارات',
        ],
    ],
];
