<?php

return [
    'location'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم المنطقة بالعربي',
                'en'    =>  'اسم المنطقة بالإنجليزية',
            ],
            'parent'    => 'تابعة إلى',
            'level' => 'نوع المنطقة',
        ],
        'label' => [
            'singular' => 'منطقة',
            'plural' => 'مناطق',
        ],
    ],

    'type'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم النوع بالعربي',
                'en'    =>  'اسم النوع بالإنجليزية',
            ],
        ],
        'label' => [
            'singular' => 'نوع عقار',
            'plural' => 'أنواع العقارات',
        ],
    ],
];
