<?php

use function Termwind\parse;

return [
    'location'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم المنطقة بالعربي',
                'en'    =>  'اسم المنطقة بالإنجليزية',
            ],
            'parent'    => 'تابعة إلى',
            'level' => 'نوع المنطقة',
        ],
        'label' => [
            'singular' => 'منطقة',
            'plural' => 'مناطق',
        ],
    ],

    'type'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم النوع بالعربي',
                'en'    =>  'اسم النوع بالإنجليزية',
            ],
        ],
        'label' => [
            'singular' => 'نوع عقار',
            'plural' => 'أنواع العقارات',
        ],
    ],

    'category'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم التصنيف بالعربي',
                'en'    =>  'اسم التصنيف بالإنجليزية',
            ],
        ],
        'label' => [
            'singular' => 'تصنيف العقار',
            'plural' => 'تصنيفات العقارات',
        ],
    ],

    'feature'  => [
        'fields'    => [
            'name'  => [
                'ar'    =>  'اسم المرفق بالعربي',
                'en'    =>  'اسم المرفق بالإنجليزية',
            ],
            'type'  => 'نوع المرفق',
            'types' => [
                'boolean' => 'نعم / لا',
                'number'    => 'قيمة رقمية',
                'select'    => 'قائمة اختيار',
            ],
            'group' => 'مجموعة المرفق',
            'group_hint'    => 'الميزات الداخلية, الميزات الخارجية, الخدمات الأساسية...',
            'type_options'  => [
                'label' => 'الخيارات',
                'value' => [
                    'ar'    => 'اسم الخيار بالعربي',
                    'en'    => 'اسم الخيار بالإنجليزية',
                ],
            ],
        ],
        'label' => [
            'singular' => 'مرفق',
            'plural' => 'المرافق',
        ],
    ],
];
